cmsis-svd/cmsis-svd/data/SiFive-Community/FE310.svd
      </registers>
    </peripheral> <!-- GPIO -->

    <peripheral>
      <name>QSPI0</name>
      <description>Serial Peripheral Interface.</description>
      <baseAddress>0x10014000</baseAddress>
      <groupName>SPI</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt><name>QSPI0_IRQ</name><value>5</value></interrupt>

      <registers>

        <register>
          <name>SCKDIV</name>
          <description>Serial Clock Divisor Register.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field><name>SCALE</name><lsb>0</lsb><msb>11</msb></field>
          </fields>
        </register>

        <register>
          <name>SCKMODE</name>
          <description>Serial Clock Mode Register.</description>
          <addressOffset>0x004</addressOffset>
          <fields>
            <field>
              <name>PHA</name><lsb>0</lsb><msb>0</msb>
              <description>Serial Clock Phase</description>
              <enumeratedValues>
                <name>CPHA</name>                
                <enumeratedValue>
                  <name>0</name>
                  <description>
                  Data is sampled on the leading edge of SCK and shifted on the trailing edge of SCK.
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>
                  Data is shifted on the leading edge of SCK and sampled on the trailing edge of SCK.
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL</name><lsb>1</lsb><msb>1</msb>
              <description>Serial Clock Polarity</description>
              <enumeratedValues>
                <name>CPOL</name>                
                <enumeratedValue>
                  <name>0</name>
                  <description>Inactive state of SCK is logical 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Inactive state of SCK is logical 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CSID</name>
          <description>Chip Select ID Register.</description>
          <addressOffset>0x010</addressOffset>
        </register>

        <register>
          <name>CSDEF</name>
          <description>Chip Select Default Register.</description>
          <addressOffset>0x014</addressOffset>
        </register>

        <register>
          <name>CSMODE</name>
          <description>Chip Select Mode Register.</description>
          <addressOffset>0x018</addressOffset>
          <fields>
            <field>
              <name>MODE</name><lsb>0</lsb><msb>1</msb>
              <enumeratedValues>
                <name>Chip_Select_Modes</name>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Assert/de-assert CS at the beginning/end of each frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD</name>
                  <description>Keep CS continuously asserted after the initial frame.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Disable hardware control of the CS pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>DELAY0</name>
          <description>Delay Control Register 0.</description>
          <addressOffset>0x028</addressOffset>
          <fields>
            <field><name>CSSCK</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>SCKCS</name><lsb>16</lsb><msb>23</msb></field>
          </fields>
        </register>

        <register>
          <name>DELAY1</name>
          <description>Delay Control Register 1.</description>
          <addressOffset>0x02C</addressOffset>
          <fields>
            <field><name>INTERCS</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>INTERXFR</name><lsb>16</lsb><msb>23</msb></field>
          </fields>
        </register>

        <register>
          <name>FMT</name>
          <description>Frame Format Register.</description>
          <addressOffset>0x040</addressOffset>
          <fields>
            <field>
              <name>PROTO</name><lsb>0</lsb><msb>1</msb>
              <enumeratedValues>
                <name>SPI_Protocol</name>
                <enumeratedValue>
                  <name>Single</name>
                  <description>Data Pins: DQ0 (MOSI), DQ1 (MISO).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>Data Pins: DQ0, DQ1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Quad</name>
                  <description>Data Pins: DQ0, DQ1, DQ2, DQ3.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>              
            </field>
            <field>
              <name>ENDIAN</name><lsb>2</lsb><msb>2</msb>
              <enumeratedValues>
                <name>SPI_Endianness</name>
                <enumeratedValue>
                  <name>MSB_First</name>
                  <description>Tansmit most-significant bit first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB_First</name>
                  <description>Transmit least-significant bit first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues> 
            </field>
            <field>
              <name>DIR</name><lsb>3</lsb><msb>3</msb>
              <enumeratedValues>
                <name>SPI_IO_Direction</name>
                <enumeratedValue>
                  <name>RX</name>
                  <description>
                  For dual and quad protocols, the DQ pins are tri-stated. 
                  For the single protocol, the DQ0 pin is driven with the transmit data as normal.
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>The receive FIFO is not populated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues> 
            </field>
            <field>
              <name>LEN</name><lsb>16</lsb><msb>19</msb>
            </field>
          </fields>
        </register>

        <register>
          <name>TXDATA</name>
          <description>Transmit Data Register.</description>
          <addressOffset>0x048</addressOffset>
          <fields>
            <field><name>DATA</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>FULL</name><lsb>31</lsb><msb>31</msb></field>
          </fields>
        </register>

        <register>
          <name>RXDATA</name>
          <description>Receive Data Register.</description>
          <addressOffset>0x04C</addressOffset>
          <fields>
            <field><name>DATA</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>EMPTY</name><lsb>31</lsb><msb>31</msb></field>
          </fields>
        </register>

        <register>
          <name>TXMARK</name>
          <description>Transmit Watermark Register.</description>
          <addressOffset>0x050</addressOffset>
          <fields>
            <field><name>TXMARK</name><lsb>0</lsb><msb>2</msb></field>
          </fields>
        </register>

        <register>
          <name>RXMARK</name>
          <description>Receive Watermark Register.</description>
          <addressOffset>0x054</addressOffset>
          <fields>
            <field><name>RXMARK</name><lsb>0</lsb><msb>2</msb></field>
          </fields>
        </register>

        <register>
          <name>IE</name>
          <description>SPI Interrupt Enable Register.</description>
          <addressOffset>0x070</addressOffset>
          <fields>
            <field><name>TXWM</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>RXWM</name><lsb>1</lsb><msb>1</msb></field>
          </fields>
        </register>

        <register>
          <name>IP</name>
          <description>SPI Interrupt Pending Register.</description>
          <addressOffset>0x074</addressOffset>
          <fields>
            <field><name>TXWM</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>RXWM</name><lsb>1</lsb><msb>1</msb></field>
          </fields>
        </register>

        <register>
          <name>FCTRL</name>
          <description>SPI Flash Interface Control Register.</description>
          <addressOffset>0x060</addressOffset>
          <fields>
            <field><name>ENABLE</name><lsb>0</lsb><msb>0</msb></field>
          </fields>
        </register>

        <register>
          <name>FFMT</name>
          <description>SPI Flash Instruction Format Register.</description>
          <addressOffset>0x064</addressOffset>
          <fields>
            <field><name>CMD_EN</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>ADDR_LEN</name><lsb>1</lsb><msb>3</msb></field>
            <field><name>PAD_CNT</name><lsb>4</lsb><msb>7</msb></field>
            <field><name>CMD_PROTO</name><lsb>8</lsb><msb>9</msb></field>
            <field><name>ADDR_PROTO</name><lsb>10</lsb><msb>11</msb></field>
            <field><name>DATA_PROTO</name><lsb>12</lsb><msb>13</msb></field>
            <field><name>CMD_CODE</name><lsb>16</lsb><msb>23</msb></field>
            <field><name>PAD_CODE</name><lsb>24</lsb><msb>31</msb></field>
          </fields>
        </register>

