cmsis-svd/cmsis-svd/data/SiFive-Community/FE310.svd
      </registers>

    </peripheral> <!-- QSPI0 -->

    <peripheral derivedFrom="QSPI0">
      <name>QSPI1</name>
      <description>Serial Peripheral Interface.</description>
      <baseAddress>0x10024000</baseAddress>
      <groupName>SPI</groupName>
      <interrupt><name>QSPI1_IRQ</name><value>6</value></interrupt>
    </peripheral> <!-- QSPI1 -->

    <peripheral derivedFrom="QSPI0">
      <name>QSPI2</name>
      <description>Serial Peripheral Interface.</description>
      <baseAddress>0x10034000</baseAddress>
      <groupName>SPI</groupName>
      <interrupt><name>QSPI2_IRQ</name><value>7</value></interrupt>
    </peripheral> <!-- QSPI2 -->

    <peripheral>
      <name>UART0</name>
      <description>Universal Asynchronous Receiver/Transmitter.</description>
      <baseAddress>0x10013000</baseAddress>
      <groupName>UART</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt><name>UART0_IRQ</name><value>3</value></interrupt>

      <registers>
        <register>
          <name>TXDATA</name>
          <description>Transmit Data Register.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field><name>DATA</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>FULL</name><lsb>31</lsb><msb>31</msb></field>
          </fields>
        </register>
        <register>
          <name>RXDATA</name>
          <description>Receive Data Register.</description>
          <addressOffset>0x004</addressOffset>
          <fields>
            <field><name>DATA</name><lsb>0</lsb><msb>7</msb></field>
            <field><name>EMPTY</name><lsb>31</lsb><msb>31</msb></field>
          </fields>
        </register>
        <register>
          <name>TXCTRL</name>
          <description>Transmit Control Register.</description>
          <addressOffset>0x008</addressOffset>
          <fields>
            <field><name>ENABLE</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>NSTOP</name><lsb>1</lsb><msb>1</msb></field>
            <field><name>TXCNT</name><lsb>16</lsb><msb>18</msb></field>
          </fields>
        </register>
        <register>
          <name>RXCTRL</name>
          <description>Receive Control Register.</description>
          <addressOffset>0x00C</addressOffset>
          <fields>
            <field><name>ENABLE</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>RXCNT</name><lsb>16</lsb><msb>18</msb></field>
          </fields>
        </register>
        <register>
          <name>IP</name>
          <description>Interrupt Pending Register.</description>
          <addressOffset>0x0010</addressOffset>
          <fields>
            <field><name>TXWM</name><lsb>0</lsb><msb>0</msb></field>
            <field><name>RXWM</name><lsb>1</lsb><msb>1</msb></field>
          </fields>
        </register>
        <register derivedFrom="IP">
          <name>IE</name>
          <description>Interrupt Enable Register.</description>
          <addressOffset>0x0014</addressOffset>
        </register>
        <register>
          <name>DIV</name>
          <description>Baud Rate Divisor Register (BAUD = Fin / (DIV + 1)).
          </description>
          <addressOffset>0x0018</addressOffset>
          <fields>
            <field><name>DIV</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>
      </registers>
    </peripheral> <!-- UART0 -->
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <description>Universal Asynchronous Receiver/Transmitter.</description>
      <baseAddress>0x10023000</baseAddress>
      <groupName>UART</groupName>
      <interrupt><name>UART1_IRQ</name><value>4</value></interrupt>
    </peripheral> <!-- UART1 -->

    <peripheral>
      <name>PWM0</name>
      <description>Pulse-Width Modulation.</description>
      <baseAddress>0x10015000</baseAddress>
      <groupName>PWM</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt><name>PWMO_CMP0_IRQ</name><value>40</value></interrupt>
      <interrupt><name>PWMO_CMP1_IRQ</name><value>41</value></interrupt>
      <interrupt><name>PWMO_CMP2_IRQ</name><value>42</value></interrupt>
      <interrupt><name>PWMO_CMP3_IRQ</name><value>43</value></interrupt>

      <registers>
        <register>
          <name>CONFIG</name>
          <description>PWM Configuration Register.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field><name>SCALE</name><lsb>0</lsb><msb>3</msb></field>
            <field><name>STICKY</name><lsb>8</lsb><msb>8</msb></field>
            <field><name>ZEROCMP</name><lsb>9</lsb><msb>9</msb></field>
            <field><name>DEGLITCH</name><lsb>10</lsb><msb>10</msb></field>
            <field><name>ENALWAYS</name><lsb>12</lsb><msb>12</msb></field>
            <field><name>ENONESHOT</name><lsb>13</lsb><msb>13</msb></field>

            <field><name>CMP_CENTER0</name><lsb>16</lsb><msb>16</msb></field>
            <field><name>CMP_CENTER1</name><lsb>17</lsb><msb>17</msb></field>
            <field><name>CMP_CENTER2</name><lsb>18</lsb><msb>18</msb></field>
            <field><name>CMP_CENTER3</name><lsb>19</lsb><msb>19</msb></field>

            <field><name>CMP_GANG0</name><lsb>24</lsb><msb>24</msb></field>
            <field><name>CMP_GANG1</name><lsb>25</lsb><msb>25</msb></field>
            <field><name>CMP_GANG2</name><lsb>26</lsb><msb>26</msb></field>
            <field><name>CMP_GANG3</name><lsb>27</lsb><msb>27</msb></field>

            <field><name>CMP_IP0</name><lsb>28</lsb><msb>28</msb></field>
            <field><name>CMP_IP1</name><lsb>29</lsb><msb>29</msb></field>
            <field><name>CMP_IP2</name><lsb>30</lsb><msb>30</msb></field>
            <field><name>CMP_IP3</name><lsb>31</lsb><msb>31</msb></field>

          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>PWM Count Register.</description>
          <addressOffset>0x008</addressOffset>
          <fields>
            <field><name>CNT</name><lsb>0</lsb><msb>30</msb></field>
          </fields>
        </register>

        <register>
          <name>SCALE_COUNT</name>
          <description>PWM Scaled Counter Register.</description>
          <addressOffset>0x010</addressOffset>
          <fields>
            <field><name>CNT</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>

        <register>
          <name>COMPARE0</name>
          <description>PWM Compare Register.</description>
          <addressOffset>0x020</addressOffset>
          <fields>
            <field><name>COMPARE</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>
        <register derivedFrom="COMPARE0">
          <name>COMPARE1</name>
          <addressOffset>0x024</addressOffset>
        </register>
        <register derivedFrom="COMPARE0">
          <name>COMPARE2</name>
          <addressOffset>0x028</addressOffset>
        </register>
        <register derivedFrom="COMPARE0">
          <name>COMPARE3</name>
          <addressOffset>0x02C</addressOffset>
        </register>

