cmsis-svd/cmsis-svd/data/SiFive-Community/FE310.svd
      </registers>
    </peripheral> <!-- PWM0 -->
    <peripheral derivedFrom="PWM0">
      <name>PWM1</name>
      <baseAddress>0x10025000</baseAddress>
      <groupName>PWM</groupName>
      <interrupt><name>PWM1_CMP0_IRQ</name><value>44</value></interrupt>
      <interrupt><name>PWM1_CMP1_IRQ</name><value>45</value></interrupt>
      <interrupt><name>PWM1_CMP2_IRQ</name><value>46</value></interrupt>
      <interrupt><name>PWM1_CMP3_IRQ</name><value>47</value></interrupt>
    </peripheral> <!-- PWM1 -->
    <peripheral derivedFrom="PWM0">
      <name>PWM2</name>
      <baseAddress>0x10035000</baseAddress>
      <groupName>PWM</groupName>
      <interrupt><name>PWM2_CMP0_IRQ</name><value>48</value></interrupt>
      <interrupt><name>PWM2_CMP1_IRQ</name><value>49</value></interrupt>
      <interrupt><name>PWM2_CMP2_IRQ</name><value>50</value></interrupt>
      <interrupt><name>PWM2_CMP3_IRQ</name><value>51</value></interrupt>
    </peripheral> <!-- PWM2 -->

    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer.</description>
      <baseAddress>0x10000000</baseAddress>
      <groupName>WDT</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt><name>Watchdog_IRQ</name><value>1</value></interrupt>

      <registers>

        <register>
          <name>COUNT</name>
          <description>Watchdog Count Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field><name>CNT</name><lsb>0</lsb><msb>30</msb></field>
          </fields>
        </register>

        <register>
          <name>CONFIG</name>
          <description>Watchdog Configuration Register.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field><name>SCALE</name><lsb>0</lsb><msb>3</msb></field>
            <field><name>RSTEN</name><lsb>8</lsb><msb>8</msb></field>
            <field><name>ZEROCMP</name><lsb>9</lsb><msb>9</msb></field>
            <field><name>ENALWAYS</name><lsb>12</lsb><msb>12</msb></field>
            <field><name>ENCOREAWAKE</name><lsb>13</lsb><msb>13</msb></field>
            <field><name>CMP_IP</name><lsb>28</lsb><msb>28</msb></field>
          </fields>
        </register>

        <register>
          <name>SCALE_COUNT</name>
          <description>Watchdog Scaled Counter Register.</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field><name>CNT</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>

        <register>
          <name>COMPARE</name>
          <description>Watchdog Compare Register.</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field><name>CMP</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>

        <register>
          <name>KEY</name>
          <description>Watchdog Key Register.</description>
          <addressOffset>0x1C</addressOffset>
        </register>

        <register>
          <name>FEED</name>
          <description>Watchdog Feed Address.</description>
          <addressOffset>0x18</addressOffset>
        </register>

      </registers>
    </peripheral> <!-- WDT -->

    <peripheral>
      <name>RTC</name>
      <description>Real-Time Clock.</description>
      <baseAddress>0x10000040</baseAddress>
      <groupName>RTC</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt><name>RTC_IRQ</name><value>2</value></interrupt>

      <registers>

        <register>
          <name>HI</name>
          <description>RTC Count Register High.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field><name>CNT</name><lsb>0</lsb><msb>15</msb></field>
          </fields>
        </register>

        <register>
          <name>LO</name>
          <description>RTC Count Register Low.</description>
          <addressOffset>0x08</addressOffset>
        </register>

        <register>
          <name>CONFIG</name>
          <description>RTC Configuration Register.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field><name>SCALE</name><lsb>0</lsb><msb>3</msb></field>
            <field><name>ENALWAYS</name><lsb>12</lsb><msb>12</msb></field>
            <field><name>CMP_IP</name><lsb>28</lsb><msb>28</msb></field>
          </fields>
        </register>

        <register>
          <name>SCALE_COUNT</name>
          <description>RTC Scaled Counter Register.</description>
          <addressOffset>0x10</addressOffset>
        </register>

        <register>
          <name>COMPARE</name>
          <description>RTC Compare Register.</description>
          <addressOffset>0x20</addressOffset>
        </register>

      </registers>
    </peripheral> <!-- RTC -->

    <peripheral>
      <name>AON</name>
      <description>AON Clock Configuration.</description>
      <baseAddress>0x10000070</baseAddress>
      <groupName>AON</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <register>
          <name>LFROSCCFG</name>
          <description>LF Ring Oscillator Configuration Register.</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field><name>DIV</name><lsb>0</lsb><msb>5</msb></field>
            <field><name>TRIM</name><lsb>16</lsb><msb>20</msb></field>
            <field><name>ENABLE</name><lsb>30</lsb><msb>30</msb></field>
            <field><name>READY</name><lsb>31</lsb><msb>31</msb></field>
          </fields>
        </register>

