cmsis-svd/cmsis-svd/data/SiFive-Community/FE310.svd
      </registers>
    </peripheral> <!-- AON -->

    <peripheral>
      <name>BACKUP</name>
      <description>Backup Registers.</description>
      <baseAddress>0x10000080</baseAddress>
      <groupName>BACKUP</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>Backup[%s]</name>
          <addressOffset>0x00</addressOffset>
        </register>

      </registers>
    </peripheral> <!-- BACKUP -->

    <peripheral>
      <name>PMU</name>
      <description>Power Management Unit.</description>
      <baseAddress>0x10000100</baseAddress>
      <groupName>PMU</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>WAKEUPI[%s]</name>
          <description>Wakeup program instructions.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field><name>DELAY</name><lsb>0</lsb><msb>3</msb></field>
            <field><name>PMU_OUT_0</name><lsb>4</lsb><msb>4</msb></field>
            <field><name>PMU_OUT_1</name><lsb>5</lsb><msb>5</msb></field>
            <field><name>CORERST</name><lsb>7</lsb><msb>7</msb></field>
            <field><name>HFCLKRST</name><lsb>8</lsb><msb>8</msb></field>
          </fields>
        </register>

        <register derivedFrom="WAKEUPI[%s]">
          <name>SLEEPI[%s]</name>
          <description>Sleep program instructions.</description>
          <addressOffset>0x20</addressOffset>
        </register>

        <register>
          <name>IE</name>
          <description>PMU interrupt enables.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field><name>RTC</name><lsb>1</lsb><msb>1</msb></field>
            <field><name>DWAKEUP</name><lsb>2</lsb><msb>2</msb></field>
          </fields>
        </register>

        <register>
          <name>CAUSE</name>
          <description>PMU wakeup cause.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>WAKEUP_CAUSE</name><lsb>0</lsb><msb>1</msb>
              <enumeratedValues>
                <name>Wakeup_Cause_Values</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC</name>
                  <description>RTC Wakeup.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWakeup</name>
                  <description>Digital input wakeup.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET_CAUSE</name><lsb>8</lsb><msb>9</msb>
              <enumeratedValues>
                <name>Reset_Cause_Values</name>
                <enumeratedValue>
                  <name>External</name>
                  <description>External reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Watchdog</name>
                  <description>Watchdog timer reset.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SLEEP</name>
          <description>Initiate sleep sequence.</description>
          <addressOffset>0x48</addressOffset>
        </register>

        <register>
          <name>KEY</name>
          <description>PMU key register.</description>
          <addressOffset>0x4C</addressOffset>
        </register>

      </registers>
    </peripheral> <!-- PMU -->

  </peripherals>
</device>
